name: "vae_decoder" 
backend: "tensorrt"
platform: "tensorrt_plan"
max_batch_size: 0

version_policy: { specific { versions: [2] } }
input [
  {
    name: "sample"
    data_type: TYPE_FP32
    dims: [ -1, 4, 64, 64 ]
  }
]
output [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ -1, 3, 512, 512 ]
  }
]
instance_group [
  {
    kind: KIND_GPU
  }
]
